app/views/episodes/_form.html.erb

SELECT "series".* FROM "series"
---
  <p>
    <%= f.select :series, Series.all.collect {|x| [x.name, x.id ]}, {:include_blank => "Select One"} %> </br>