app/controllers/episodes_controller.rb

  def index
    @episodes = Episode.all
---
SELECT "episodes".* FROM "episodes"

  def create

    @episode = Episode.new(episode_params.merge(:user => current_user.id))

    respond_to do |format|
      if @episode.save
---
INSERT INTO "episodes" ("name", "description", "series", "season", "episode_number", "created_at", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", "3"], ["description", "3"], ["series", "6"], ["season", 3], ["episode_number", 3], ["created_at", 2017-04-26 15:29:01 UTC], ["updated_at", 2017-04-26 15:29:01 UTC], ["user", 5]]

    def set_episode
      @episode = Episode.find(params[:id])
---
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]