app/controllers/series_controller.rb

  def index
    @series = Series.all
---
SELECT "series".* FROM "series"

  def create
    @series = Series.new(series_params.merge(:user => current_user.id))

    respond_to do |format|
      if @series.save
---
INSERT INTO "series" ("name", "description", "category", "season", "created_at", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "probando3"], ["description", "adslaksadsa"], ["category", "2"], ["season", 1], ["created_at", 2017-04-26 15:19:28 UTC], ["updated_at", 2017-04-26 15:19:28 UTC], ["user", 5]]

  def update
    respond_to do |format|
      if @series.update(series_params)
---
UPDATE "series" SET "description" = ?, "updated_at" = ? WHERE "series"."id" = ?  [["description", "Michael scofield se escapa de la carcel 11111111"], ["updated_at", 2017-04-29 21:29:59 UTC], ["id", 48]]

  def destroy
    @series.destroy
---
DELETE FROM "series" WHERE "series"."id" = ?  [["id", 8]]

    def set_series
      @series = Series.find(params[:id])
---
SELECT  "series".* FROM "series" WHERE "series"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]