app/views/series/_form.html.erb

SELECT "categories".* FROM "categories"
---
  <p>
    <%= f.select :category, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => "Select One"} %> </br>