app/views/series/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
      <%if !user_signed_in?%>
          <% if User.find(serie.user).admin %>

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
                <td><%= serie.season %></td>
                <td><%= Category.find(serie.category).name %></td>