app/views/series/show.html.erb

  <tbody>
    <% Episode.all.collect do |episode| %>
    <% if episode.season == @series.season && Series.find(episode.series).id == @series.id %>

      <% if User.find(@series.user).admin && current_user.id.to_s == @series.user%>
---
SELECT "episodes".* FROM "episodes"
SELECT  "series".* FROM "series" WHERE "series"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]